#include <iostream>

void F(int numb) {
    std::string TENS[20] = { "","один","два","три","четыре","п€ть","шесть","семь","восемь","дев€ть","дес€ть","одиннадцать",
        "двенадцать","тринадцать","четырнадцать","п€тнадцать","шестнадцать","семнадцать","восемнадцать","дев€тнадцать" };
    std::string TENS2[10] = { "","","двадцать","тридцать","сорок","п€тьдес€т","шестьдес€т","семьдес€т","восемьдес€т","дев€носто" };
    std::string HUNDREDS[10] = { "","сто","двести","триста","четыреста","п€тьсот","шестьсот","семьсот","восемьсот","дев€тьсот" };
    if (numb != 0) {
        std::cout << HUNDREDS[numb / 100] << " ";
    }
    if (numb % 100 > 19) {
        std::cout << TENS2[(numb / 10) % 10] << " ";
        std::cout << TENS[numb % 10] << " ";
    }
    else {
        std::cout << TENS[numb % 100] << " ";
    }
}

int main8() {
    int N, X;
    std::cin >> N;
    setlocale(LC_ALL, "Russian");
    if (N == 1000000000) {
        std::cout << "один миллиард";
        N = 0;
    }
    X = (N / 1000000);
    N = N % 1000000;
    if (X != 0) {
        F(X);
        if ((X % 100 > 19) || (X % 100 < 10)) {
            if (X % 10 == 1) {
                std::cout << "миллион" << " ";
            }
            else if ((X % 10 == 2) || (X % 10 == 3) || (X % 10 == 4)) {
                std::cout << "миллиона" << " ";
            }
            else {
                std::cout << "миллионов" << " ";
            }
        }
        else {
            std::cout << "миллионов" << " ";
        }
    }
    X = N / 1000;
    N = N % 1000;
    if (X != 0) {
        if ((X % 100 > 19) || (X % 100 < 10)) {
            if (X % 10 == 1) {
                --X;
                F(X);
                std::cout << "одна тыс€ча" << " ";
            }
            else if (X % 10 == 2) {
                X -= 2;
                F(X);
                std::cout << "две тыс€чи" << " ";
            }
            else if ((X % 10 == 3) || (X % 10 == 4)) {
                F(X);
                std::cout << "тыс€чи" << " ";
            }
            else {
                F(X);
                std::cout << "тыс€ч" << " ";
            }
        }
        else {
            F(X);
            std::cout << "тыс€ч" << " ";
        }
    }
    F(N);
    return 0;
}